# Movies Tonight Part 3: SQL DML

In [1]:
%load_ext sql
%sql sqlite:///Movies.db

'Connected: @Movies.db'

1. **Load the `DATASET.csv` file into the `Movies.db` database.**  
    - Import the CSV file to create a new table called `DATASET`. Follow the example [here](http://www.sqlitetutorial.net/sqlite-import-csv/).
    - Use a [`PRAGMA table-info` pseudo-query](https://www.sqlite.org/pragma.html#pragma_table_info) to inspect the design of the new table. [How are we going to handle dates](https://www.sqlite.org/datatype3.html)?

Remember!
- use this to get data from csv file- open terminal - sqlite3 Movies.db - follow "here" link
- .table will give list of tables- can check for duplicates!!
- PRAGMA will give metadata

In [3]:
%%sql

SELECT * FROM DATASET LIMIT 10
PRAGMA table_info(DATASET);

 * sqlite:///Movies.db
(sqlite3.OperationalError) no such table: DATASET
[SQL: SELECT * FROM DATASET LIMIT 10;]
(Background on this error at: http://sqlalche.me/e/e3q8)

2. **Populate the tables with data.**  

    - Use `INSERT ... SELECT ...` queries to extract data from `DATASET` for each table of your other tables. 
    - Start with the strong entities before moving on to the weak ones. Be sure to always select distinct     values. 
    - Foreign Keys get special treatment. You will have to use JOINs to pick up the PKs from the other side of the relationships. (As in Part 1, use the fact that movie names, theater names, and people names are always unique in our source data. That way you can use then for the JOIN columns. 
    - If you have to start over, then rerun your DDL queries from Part 2.

In [ ]:
%%sql

DELETE FROM MOVIES;
SELECT DISTINCT MTitle, Rating FROM DATASET
LIMIT 10;

lets insert into the table!
REMEMBER: INSERT INTO table (part 2 titles)
          SELECT DISTINCT (columns from DATASET)
Shows- joining the other two tables to retrieve data for the shows table

In [ ]:
%%sql

DELETE FROM Movies;
INSERT INTO Movies (Title, Rating)
    SELECT DISTINCT MTitle, Rating FROM DATASET;
SELECT * FROM MOVIES;

In [ ]:
%%sql
DELETE FROM Theaters;
INSERT INTO Theaters (Name, Location, Phone)
    SELECT DISTINCT TName, Location, Phone FROM DATASET;
SELECT * FROM Theaters;

In [ ]:
%%sql
DELETE FROM Artists;
INSERT INTO Artists (Name)
    SELECT DISTINCT CName FROM DATASET;
SELECT * FROM Artists
LIMIT 10;

In [ ]:
%%sql
DELETE FROM Shows;
INSERT INTO Shows (ShowTime, MID, TID)
    SELECT DISTINCT DATASET.ShowTime, MOVIES.MID, THEATERS.TID
    FROM DATASET
        JOIN MOVIES ON (MOVIES.Title = DATASET.MTitle)
        JOIN THEATERS ON (THEATERS.Name = DATASET.TName);
SELECT ShowTime, Title, Name FROM Shows JOIN Movies USING (MID) JOIN Theaters USING (TID)
LIMIT 10;

In [ ]:
%%sql
DELETE FROM Credit;
INSERT INTO Credit (CCode, MID, AID)
    SELECT DISTINCT DATASET.CCode, MOVIES.MID, ARTISTS.AID
    FROM DATASET
        JOIN ARTISTS ON (ARTISTS.NAME = DATASET.CName)
        JOIN MOVIES ON (MOVIES.Title = DATASET.MTitle);
SELECT * FROM CREDIT;

3. **Check your work.**  
There are 9 theaters, 23 movies, 152 artists, 131 shows, and 161 credits.

In [ ]:
# checked in cells above

4. **Now check the source data.**  
There are actually 13 duplicate rows in the original source data! Can you spot them? Write a SQL query that counts how many times each (MTitle, TName, Showtime, CCode, and CName) appears. Which ones appear more than once?

In [ ]:
%%sql
/* Found using https://chartio.com/learn/databases/how-to-find-duplicate-values-in-a-sql-table/ */
    
SELECT MTitle, TName, Showtime, CCode, CName, COUNT(*) occurrences
FROM DATASET
GROUP BY MTitle, TName, Showtime, CCode, CName
HAVING 
    COUNT(*) > 1;

5. **Drop the `DATASET` table.**  
We don't need it anymore.

In [ ]:
%%sql
DROP TABLE IF EXISTS DATASET

6. **Save, commit, and push your work to GitHub.**  
Use the commit summary comment "Completed Part 3".